[{"description":"Create a striking book landing page for 'The Man and the Hare: The land remembers lest we forget' by Stephen Lindley. The book is a Celtic mythology fantasy about a nameless man who awakens in an unraveling world and must face Balor, the god of endings. Guided by Merlin and joined by the fae, he becomes a vessel for the land's last hope. The book was published December 15, 2025 (112 pages) and is available on Amazon. Include: hero section with atmospheric design that reflects the Celtic mythology theme, book synopsis ('In a land where memory is older than kings and every field holds the echo of a story, a nameless man awakens to a world unraveling. Drawn by a relic carved from myth and moonlight, he is thrust into a conflict older than Camelot itself. Balor, the god of endings, has broken free. His shadow poisons the rivers, empties villages, and turns despair into an army. To stand against him, the man must walk the seam between worlds: the everyday soil under his feet, and the ancient realm that breathes just beneath it. Guided by Merlin, hunted by Mordred, and joined by the fae who remember the first dawn, he becomes something neither wholly mortal nor wholly legend, a vessel for the land's last hope. As Camelot burns and the old powers wake, he must choose what he is willing to become, and what he is willing to lose, to keep the world from slipping into oblivion. The Man and the Hare is a meditation on transformation, belonging, and the thin boundary between the ordinary and the eternal. Rooted in Celtic myth and told with the stark beauty of a dying dawn, it is a story of a man finding his place in a world where field and legend share the same breath, and where the land remembers, even when its people forget.'), author information (Stephen Lindley), prominent call-to-action button linking to Amazon UK (https://www.amazon.co.uk/dp/B0G819RYX9), book details (Publication: December 15, 2025, Pages: 112, Genre: Fantasy/Celtic Mythology/Arthurian, Rating: 5.0/5 stars, ISBN: 979-8277364819), and overall mystical, mythological aesthetic that feels ancient and timeless","type":"feature","passes":true,"id":1},{"description":"Refine the hero section typography to be more striking and impactful - experiment with letter spacing, font weights, and hierarchy to make the book title more commanding and memorable","type":"feature","passes":true,"id":2},{"description":"Verify the CTA button correctly links to https://www.amazon.co.uk/dp/B0G819RYX9 - ensure it opens in a new tab","type":"bug","passes":true,"id":3},{"description":"Add an atmospheric background image to the hero section - generate or source a mystical Celtic landscape image (misty ancient stones, ethereal dawn light, mythological atmosphere) and integrate it as a hero background with proper overlay to ensure text readability","type":"feature","passes":true,"id":4},{"description":"Add the hero background image from ./hero-background.png as the background for the hero section. Apply it as a full-width background with center positioning, cover sizing, and add a dark overlay gradient to ensure the gold text remains highly readable and striking against the image of ancient Celtic standing stones at misty dawn.","type":"feature","passes":true,"id":5},{"description":"Refine the hero title typography to match the book cover style - make it much less bold (lighter font weight), more elegant and refined with a classic serif feel. The book cover uses thin, sophisticated lettering that's graceful rather than heavy. Adjust font weight to light or normal, remove any bold styling, and make it feel more literary and sophisticated rather than commanding and heavy","type":"feature","passes":true,"id":6},{"description":"Replace the hero background image with ./hero-background.jpg - ensure it displays properly as a full-width background with appropriate positioning and overlay to maintain text readability","type":"feature","passes":true,"id":7},{"description":"Reduce the darkness of the hero overlay to make the background image more visible - lighten the overlay gradients significantly while still maintaining enough contrast for the gold text to remain readable","type":"feature","passes":true,"id":8},{"description":"Add a subtle parallax scroll effect to the hero background image - make the background move at a slower rate than the page scroll to create a sense of depth and visual interest","type":"feature","passes":true,"id":9},{"description":"Reduce the hero title text size by 25% from its current size, change the text color to #ecedd1 (solid color, no gradient), and remove any gradient effects on the text","type":"feature","passes":true,"id":10},{"description":"Change all section headers throughout the page to the color #ecedd1 to match the hero text color","type":"feature","passes":true,"id":11},{"description":"Change the hero background image positioning so it aligns to the right at tablet and mobile breakpoints - use responsive object positioning so the image is centered on desktop but right-aligned on tablet and mobile screens","type":"feature","passes":true,"id":12},{"description":"Fix the hero background image alignment - it's still showing centered on mobile and tablet. Ensure the image uses object-right positioning on mobile and tablet screens (below md breakpoint) and verify the responsive classes are properly applied","type":"bug","passes":true,"id":13},{"description":"The hero image is right-aligned on mobile but still centered on tablet. Adjust the media query breakpoint so that right-alignment applies to both mobile AND tablet screens, and only switches to center alignment at desktop sizes (above 1024px/lg breakpoint instead of 768px/md)","type":"bug","passes":true,"id":14},{"description":"Change the hero background image alignment breakpoint from 1024px to 1200px - keep the image right-aligned for all screens below 1200px and only center it on larger desktop screens (1200px and above)","type":"feature","passes":true,"id":15},{"description":"Change the color of the subtitle 'The land remembers lest we forget', the author line 'by Stephen Lindley', and the rating '5.0 / 5' to #babb99","type":"feature","passes":true,"id":16},{"description":"Add the email address stephenlindley@btinternet.com to the Stephen Lindley name in the footer - display it as a clickable mailto link","type":"feature","passes":true,"id":17}]